Tekla Open API Reference for Tekla Structures 2025
WeldMarkAttributes Constructor
Overload List
Name | Description
WeldMark.WeldMarkAttributes()
 Creates a new default weld mark attributes instance that loads standard attributes.
WeldMark.WeldMarkAttributes(String)
 Creates a new weld mark attributes instance that loads the specified attributes.
Top
See Also
Reference
WeldMark.WeldMarkAttributes Class
Tekla.Structures.Drawing Namespace